[{"url": ["http://www.pythonware.com/daily/"], "name": ["eff-bot's Daily Python URL"], "description": ["- Contains links to assorted resources from the Python universe, compiled by PythonWare.\r"]},
{"url": ["http://www.oinko.net/freepython/"], "name": ["Free Python and Zope Hosting Directory"], "description": ["- A directory of free Python and Zope hosting providers, with reviews and ratings.\r"]},
{"url": ["http://oreilly.com/python/"], "name": ["O'Reilly Python Center"], "description": ["- Features Python books, resources, news and articles.\r"]},
{"url": ["https://www.python.org/dev/"], "name": ["Python Developer's Guide"], "description": ["- Resources for reporting bugs, accessing the Python source tree with CVS and taking part in the development of Python.\r"]},
{"url": ["http://win32com.goermezer.de/"], "name": ["Social Bug"], "description": ["- Scripts, examples and news about Python programming for the Windows platform.\r"]},
{"url": ["http://www.pearsonhighered.com/educator/academic/product/0,,0130260363,00%2Ben-USS_01DBC.html"], "name": ["Core Python Programming"], "description": ["- By Wesley J. Chun; Prentice Hall PTR, 2001, ISBN 0130260363. For experienced developers to improve extant skills; professional level examples. Starts by introducing syntax, objects, error handling, functions, classes, built-ins. [Prentice Hall]\r"]},
{"url": ["http://www.brpreiss.com/books/opus7/html/book.html"], "name": ["Data Structures and Algorithms with Object-Oriented Design Patterns in Python"], "description": ["- The primary goal of this book is to promote object-oriented design using Python and to illustrate the use of the emerging object-oriented design patterns.\r"]},
{"url": ["http://www.diveintopython.net/"], "name": ["Dive Into Python 3"], "description": ["- By Mark Pilgrim, Guide to Python 3  and its differences from Python 2. Each chapter starts with a real code sample and explains it fully. Has a comprehensive appendix of all the syntactic and semantic changes in Python 3\r"]},
{"url": ["http://rhodesmill.org/brandon/2011/foundations-of-python-network-programming/"], "name": ["Foundations of Python Network Programming"], "description": ["- This book covers a wide range of topics. From raw TCP and UDP to encryption with TSL, and then to HTTP, SMTP, POP, IMAP, and ssh. It gives you a good understanding of each field and how to do everything on the network with Python.\r"]},
{"url": ["http://www.techbooksforfree.com/perlpython.shtml"], "name": ["Free Python books"], "description": ["- Free Python books and tutorials.\r"]},
{"url": ["http://www.freetechbooks.com/python-f6.html"], "name": ["FreeTechBooks: Python Scripting Language"], "description": ["- Annotated list of free online books on Python scripting language. Topics range from beginner to advanced.\r"]},
{"url": ["http://greenteapress.com/thinkpython/"], "name": ["How to Think Like a Computer Scientist: Learning with Python"], "description": ["- By Allen B. Downey, Jeffrey Elkner, Chris Meyers; Green Tea Press, 2002, ISBN 0971677506. Teaches general principles of programming, via Python as subject language. Thorough, in-depth approach to many basic and intermediate programming topics. Full text online and downloads: HTML, PDF, PS, LaTeX. [Free, Green Tea Press]\r"]},
{"url": ["http://www.network-theory.co.uk/python/intro/"], "name": ["An Introduction to Python"], "description": ["- By Guido van Rossum, Fred L. Drake, Jr.; Network Theory Ltd., 2003, ISBN 0954161769. Printed edition of official tutorial, for v2.x, from Python.org. [Network Theory, online]\r"]},
{"url": ["http://www.freenetpages.co.uk/hp/alan.gauld/"], "name": ["Learn to Program Using Python"], "description": ["- Book by Alan Gauld with full text online. Introduction for those learning programming basics: terminology, concepts, methods to write code. Assumes no prior knowledge but basic computer skills.\r"]},
{"url": ["http://www.wiley.com/WileyCDA/WileyTitle/productCd-0471219754.html"], "name": ["Making Use of Python"], "description": ["- By Rashi Gupta; John Wiley and Sons, 2002, ISBN 0471219754. Covers language basics, use for CGI scripting, GUI development, network programming; shows why it is one of more sophisticated of popular scripting languages. [Wiley]\r"]},
{"url": ["http://hetland.org/writing/practical-python/"], "name": ["Practical Python"], "description": ["- By Magnus Lie Hetland; Apress LP, 2002, ISBN 1590590066. Readable guide to ideas most vital to new users, from basics common to high level languages, to more specific aspects, to a series of 10 ever more complex programs. [Apress]\r"]},
{"url": ["http://sysadminpy.com/"], "name": ["Pro Python System Administration"], "description": ["- By Rytis Sileika, ISBN13: 978-1-4302-2605-5, Uses real-world system administration examples like manage devices with SNMP and SOAP, build a distributed monitoring system, manage web applications and parse complex log files, monitor and manage MySQL databases.\r"]},
{"url": ["http://www.qtrac.eu/py3book.html"], "name": ["Programming in Python 3 (Second Edition)"], "description": ["- A Complete Introduction to the Python 3.\r"]},
{"url": ["http://www.wiley.com/WileyCDA/WileyTitle/productCd-0764548077.html"], "name": ["Python 2.1 Bible"], "description": ["- By Dave Brueck, Stephen Tanner; John Wiley and Sons, 2001, ISBN 0764548077. Full coverage, clear explanations, hands-on examples, full language reference; shows step by step how to use components, assemble them, form full-featured programs. [John Wiley and Sons]\r"]},
{"url": ["https://www.packtpub.com/python-3-object-oriented-programming/book"], "name": ["Python 3 Object Oriented Programming"], "description": ["- A step-by-step tutorial for OOP in Python 3, including discussion and examples of abstraction, encapsulation, information hiding, and raise, handle, define, and manipulate exceptions.\r"]},
{"url": ["http://www.network-theory.co.uk/python/language/"], "name": ["Python Language Reference Manual"], "description": ["- By Guido van Rossum, Fred L. Drake, Jr.; Network Theory Ltd., 2003, ISBN 0954161785. Printed edition of official language reference, for v2.x, from Python.org, describes syntax, built-in datatypes. [Network Theory, online]\r"]},
{"url": ["http://www.pearsonhighered.com/educator/academic/product/0,,0130409561,00%2Ben-USS_01DBC.html"], "name": ["Python Programming Patterns"], "description": ["- By Thomas W. Christopher; Prentice Hall PTR, 2002, ISBN 0130409561. Shows how to write large programs, introduces powerful design patterns that deliver high levels of robustness, scalability, reuse.\r"]},
{"url": ["http://www.informit.com/store/product.aspx?isbn=0201616165&redir=1"], "name": ["Python Programming with the Java Class Libraries: A Tutorial for Building Web and Enterprise Applications with Jython"], "description": ["- By Richard Hightower; Addison-Wesley, 2002, 0201616165. Begins with Python basics, many exercises, interactive sessions. Shows programming novices concepts and practical methods. Shows programming experts Python's abilities and ways to interface with Java APIs. [publisher website]\r"]},
{"url": ["http://www.pearsonhighered.com/educator/academic/product/0,,0201748843,00%2Ben-USS_01DBC.html"], "name": ["Python: Visual QuickStart Guide"], "description": ["- By Chris Fehily; Peachpit Press, 2002, ISBN 0201748843. Task-based, step-by-step visual reference guide, many screen shots, for courses in digital graphics; Web design, scripting, development; multimedia, page layout, office tools, operating systems. [Prentice Hall]\r"]},
{"url": ["http://www.informit.com/store/product.aspx?isbn=0672317354"], "name": ["Sams Teach Yourself Python in 24 Hours"], "description": ["- By Ivan Van Laningham; Sams Publishing, 2000, ISBN 0672317354. Split into 24 hands-on, 1 hour lessons; steps needed to learn topic: syntax, language features, OO design and programming, GUIs (Tkinter), system administration, CGI. [Sams Publishing]\r"]},
{"url": ["http://gnosis.cx/TPiP/"], "name": ["Text Processing in Python"], "description": ["- By David Mertz; Addison Wesley. Book in progress, full text, ASCII format. Asks for feedback. [author website, Gnosis Software, Inc.]\r"]},
{"url": ["http://www.informit.com/store/product.aspx?isbn=0130211192"], "name": ["XML Processing with Python"], "description": ["- By Sean McGrath; Prentice Hall PTR, 2000, ISBN 0130211192, has CD-ROM. Methods to build XML applications fast, Python tutorial, DOM and SAX, new Pyxie open source XML processing library. [Prentice Hall PTR]\r"]}]